#Задача 34:Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”,если с ритмом все не в порядке
#Пример:
#Ввод: пара-ра-рам рам-пам-папам па-ра-па-дам
#Вывод: Парам пам-пам

def func(str):
    str = str.lower().split(' ')
    my_list = list()
    for word in str:
        result = 0
        for i in word:
            if i in vowels:
                result += 1
        my_list.append(result)
    return len(my_list) == my_list.count(my_list[0])


vowels = ['a', 'e', 'i', 'o', 'u', 'y', 'а', 'е', 'ё', 'и', 'о', 'у', 'ы', 'э', 'ю', 'я']
str = input('Введите кричалку Винни-Пуха: ')
if func(str):
    print('Парам пам-пам')
else:
    print('Пам парам')



#Задача 36: Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6), которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца. Аргументы num_rows и num_columns указывают число строк и столбцов таблицы, которые должны быть распечатаны. Нумерация строк и столбцов идет с единицы (подумайте, почему не с нуля). Примечание: бинарной операцией называется любая операция, у которой ровно два аргумента, как, например, у операции умножения.
#Пример:
#Ввод:`print_operation_table(lambda x, y: x * y) `
#Вывод:
# 1 2 3 4 5 6
# 2 4 6 8 10 12
# 3 6 9 12 15 18
# 4 8 12 16 20 24
# 5 10 15 20 25 30
# 6 12 18 24 30 36

def print_operation_table(operation, num_rows=6, num_columns=6):
    my_list = [[operation(i, j) for j in range(1, num_columns + 1)] for i in range(1, num_rows + 1)]
    for i in my_list:
        print(*[f'{x: > 3}' for x in i])

print_operation_table(lambda x, y: x * y)


# Решение без магических чисел. Так-то оно получше будет...
def print_operation_table(operation):
    my_list = [[operation(i, j) for j in range(1, columns + 1)] for i in range(1, rows + 1)]
    for i in my_list:
        print(*[f'{x:>3}' for x in i])


rows = int(input('Введите количество строк: '))
columns = int(input('Введите количество столбцов: '))
print_operation_table(lambda x, y: x * y)

